/* // Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, 
что третьей цифры нет.
645 -> 5
78 -> третьей цифры нет
32679 -> 6 */
internal partial class Program
{
    private static void Main(string[] args)
    {
        Console.WriteLine("Напишите число ");
        int num = int.Parse(Console.ReadLine()); 
    
     for (int i = 0; i < num; i++);

        if ()
        {
            Console.WriteLine(num[2]);
        }
        else
        {
            Console.WriteLine("Третьей цифры нет");
        } */
    }
}